{
    "ginger": "Ginger, scientifically known as Zingiber officinale, is a powerful herb used in Ayurveda, Siddha, and Unani medicine. Its rhizome is valued for anti-inflammatory and digestive properties, effectively relieving nausea, reducing joint pain, and improving digestion.",
    "aloe_vera": "Aloe Vera, or Aloe barbadensis miller, is a cornerstone of Ayurvedic and Siddha medicine. Known for its cooling and anti-inflammatory properties, it soothes skin burns, promotes wound healing, and supports digestive health through its gel-rich leaves.",
    "lemon": "Lemon, Citrus limon, is widely used across Ayurveda, Siddha, and Unani traditions. Rich in antioxidants and vitamin C, it boosts immunity, aids digestion, and helps prevent scurvy. Both the fruit and peel offer therapeutic benefits.",
    "cucumber": "Cucumber, Cucumis sativus, is valued in traditional medicine for its cooling and hydrating properties. It helps reduce body heat, soothes skin inflammation, and alleviates acidity, making it an excellent natural remedy for digestive comfort.",
    "senna": "Senna, or Senna alexandrina, is a powerful natural laxative used in Ayurveda, Siddha, and Unani systems. Its leaves and pods effectively relieve constipation and cleanse the colon, though it should not be used long-term.",
    "licorice": "Licorice, Glycyrrhiza glabra, is a soothing herb with anti-inflammatory and expectorant properties. Its root is used to relieve coughs, soothe throat irritation, and support digestive health across multiple traditional medicine systems.",
    "rose": "Rose, Rosa indica, is cherished in Ayurveda, Siddha, Unani, and Homeopathy for its cooling and anti-inflammatory properties. Its petals soothe skin, reduce stress, and improve digestion, offering both therapeutic and aromatic benefits.",
    "nux_vomica": "Nux vomica, from Strychnos nux-vomica, is used exclusively in homeopathic preparations. In microdoses, it stimulates digestion and the nervous system. However, the seeds are highly toxic and should never be used except in properly prepared homeopathic form.",
    "calendula": "Calendula, or Calendula officinalis, is renowned for its anti-inflammatory and antimicrobial properties. Its bright flowers promote wound healing, reduce skin inflammation, and fight infections, making it a valuable remedy for skin conditions.",
    "fennel": "Fennel, Foeniculum vulgare, is a digestive powerhouse in traditional medicine. Its seeds contain carminative properties that reduce bloating, relieve gas, and support overall digestive health through their gentle, warming action.",
    "adhatoda": "Adhatoda, or Adhatoda vasica, is a respiratory tonic used in Ayurveda, Siddha, and Unani medicine. Its leaves act as an expectorant and bronchodilator, effectively relieving coughs and improving respiratory health.",
    "nilavembu": "Nilavembu, Andrographis paniculata, is a powerful immunity booster with anti-malarial properties. Used in Ayurveda, Siddha, and Unani, it prevents malaria, strengthens immune function, and supports liver health.",
    "thuthuvalai": "Thuthuvalai, Solanum trilobatum, is a respiratory tonic valued in traditional medicine. Its leaves and stem treat coughs, improve lung health, and reduce inflammation, making it especially useful for asthma and respiratory conditions.",
    "arnica": "Arnica montana is a healing herb used in Homeopathy and Ayurveda. Its flowers provide powerful anti-inflammatory and pain-relieving effects, reducing bruises, relieving muscle pain, and promoting wound healing when applied topically.",
    "turmeric": "Turmeric, Curcuma longa, is one of the most powerful anti-inflammatory herbs in Ayurveda. Its golden rhizome contains curcumin, which reduces inflammation, supports liver health, boosts immunity, and alleviates joint pain.",
    "ashwagandha": "Ashwagandha, Withania somnifera, is a renowned adaptogenic herb in Ayurveda and Unani medicine. Its root reduces stress, improves sleep quality, enhances vitality, and strengthens the immune system naturally.",
    "tulsi": "Tulsi, or Holy Basil, Ocimum sanctum, is a sacred adaptogenic herb in Ayurveda. Its leaves relieve respiratory disorders, reduce stress, boost immunity, and help manage fever through their antimicrobial and anti-inflammatory properties.",
    "neem": "Neem, Azadirachta indica, is a powerful blood purifier with antibacterial and antifungal properties. Its leaves, bark, and seeds treat skin conditions, purify blood, control diabetes, and fight various infections.",
    "brahmi": "Brahmi, Bacopa monnieri, is a renowned nootropic herb in Ayurveda and Siddha medicine. This whole plant enhances memory, reduces anxiety, and improves cognitive function through its neuroprotective properties.",
    "amla": "Amla, or Indian Gooseberry, Phyllanthus emblica, is exceptionally rich in vitamin C and antioxidants. This rejuvenating fruit boosts immunity, improves digestion, promotes hair growth, and slows the aging process.",
    "triphala": "Triphala is a classical Ayurvedic formulation combining three fruits: Haritaki, Bibhitaki, and Amla. This powerful blend improves digestion, cleanses the colon, supports eye health, and provides potent antioxidant benefits.",
    "haritaki": "Haritaki, Terminalia chebula, is a rejuvenating fruit in Ayurveda, Siddha, and Unani medicine. It acts as a gentle laxative, improves digestion, and detoxifies the body, earning it the title of the king of medicines.",
    "guggul": "Guggul, from Commiphora wightii, is a resin valued for its anti-inflammatory and cholesterol-lowering properties. It supports weight management, reduces cholesterol levels, and treats arthritis effectively in Ayurvedic and Unani traditions.",
    "shatavari": "Shatavari, Asparagus racemosus, is a rejuvenating herb for reproductive health in Ayurveda and Unani medicine. Its root supports hormonal balance, enhances fertility, and increases lactation in nursing mothers.",
    "guduchi": "Guduchi, or Giloy, Tinospora cordifolia, is a powerful immunomodulator in traditional medicine. Its stem boosts immunity, reduces fever, treats chronic infections, and helps manage diabetes through its antipyretic properties.",
    "bhringraj": "Bhringraj, Eclipta alba, is known as the king of hair in Ayurveda and Siddha medicine. Its leaves promote hair growth, support liver health, and enhance memory through their hepatoprotective and nootropic properties.",
    "punarnava": "Punarnava, Boerhavia diffusa, is a rejuvenating diuretic herb in Ayurveda, Siddha, and Unani medicine. Its root treats kidney disorders, reduces edema, and supports heart health through its anti-inflammatory action.",
    "shankhpushpi": "Shankhpushpi, Convolvulus pluricaulis, is a powerful brain tonic in Ayurveda. This whole plant enhances memory, reduces stress and anxiety, and improves sleep quality through its nootropic and sedative properties.",
    "manjistha": "Manjistha, Rubia cordifolia, is a premier blood purifier in Ayurveda and Siddha medicine. Its root treats skin diseases, purifies blood, and promotes wound healing through its anti-inflammatory and antimicrobial properties.",
    "vidanga": "Vidanga, Embelia ribes, is an anthelmintic herb used in Ayurveda and Siddha medicine. Its fruit removes intestinal worms, improves digestion, and treats skin diseases through its antimicrobial properties.",
    "kutki": "Kutki, Picrorhiza kurroa, is a powerful hepatoprotective herb in Ayurveda and Siddha medicine. Its rhizome supports liver health, treats jaundice, and boosts immunity through its anti-inflammatory properties.",
    "pippali": "Pippali, or Long Pepper, Piper longum, is a bioenhancer in Ayurveda, Siddha, and Unani medicine. Its fruit treats respiratory disorders, improves digestion, and enhances the absorption of other herbs and nutrients.",
    "bala": "Bala, Sida cordifolia, is a rejuvenating tonic in Ayurveda and Siddha medicine. Its root and whole plant strengthen muscles, improve stamina, and treat nervous disorders through their nervine and anti-inflammatory properties.",
    "jatamansi": "Jatamansi, Nardostachys jatamansi, is a calming herb in Ayurveda and Unani medicine. Its rhizome reduces stress and anxiety, improves sleep quality, and enhances memory through its sedative and neuroprotective properties.",
    "vacha": "Vacha, or Sweet Flag, Acorus calamus, is a powerful nootropic in Ayurveda and Unani medicine. Its rhizome enhances memory, treats epilepsy, and improves speech, though it should be used cautiously and avoided during pregnancy."
}